DeviceLogonEvents
| where ActionType == "LogonSuccess"
| summarize FirstLogonTime=min(Timestamp) by DeviceName, AccountDomain, AccountName, AccountSid
| join kind=inner (
    DeviceInfo
    | project DeviceId, DeviceName, OSPlatform, OnboardingStatus
    | where OnboardingStatus == "Onboarded"
) on DeviceName
| extend AccountFullName = strcat(AccountDomain, "\", AccountName)
| summarize by AccountFullName, AccountSid, OSPlatform
| project AccountFullName, AccountSid, OSPlatform